{
    "fullName": "Fabio Trisera",
    "jobTitle": "Senior Software Engineer",
    "headline": [
        "Over 15 years of experience in full-stack development, specializing in Angular, React, and .NET Core. Proficient in testing frameworks and methodologies, with extensive exposure to microservice with Docker and comprehensive cloud technologies, including Azure and AWS.",
        "Proven leader in guiding and mentoring global teams to deliver scalable software solutions. Expertise in microservices architecture, CI/CD. Skilled at driving technology initiatives, fostering innovation, and implementing best practices to enhance software quality and reliability. Dedicated to continuous improvement and cross-functional teamwork to achieve business goals."
    ],
    "workExperiences": [
        {
            "companyName": "ZINC GROUP",
            "companyUrl": "https://www.zincgroup.com",
            "jobTitle": "Senior Developer",
            "jobLength": "June 2022 - Present",
            "highlights": [
                "Planned and migrated existing large-scale supply chain management system monolith to AWS cloud resources such as AWS Lambda, AWS RDS, AWS API Gateway, AWS ELB, AWS CloudFront, AWS CloudWatch, CloudTrail for observability and AWS CloudFormation for IaaS deployment, creating a distributed,scalable system with React, Redux and TypeScript front-end by following best practices.",
                "Defined development team coding standards and best practices,code review process by using Github pull request, and Improving existing CI/CD and automated testing through unit testing and end-to-end testing (Cypress & Playwright) in Github Action, which resulted in a 20% increase in software quality, reliability, and security"
            ],
            "skills": ["React", "Redux", "TypeScript", "AWS", "CI/CD", "Cypress", "Playwright"]
        },
        {
            "companyName": "Frontier Software",
            "companyUrl": "https://au.frontiersoftware.com",
            "jobTitle": "Web Development Manager",
            "jobLength": "January 2018 - June 2022",
            "highlights": [
                "Helped build a technology culture that embraces the latest web technology, spearheading upgrade of AngularJs application to the latest Angular and building reusable component library and following industry best practices through regular team product and technology showcases, resulting in an average 20% increase in team velocity, 25% improved code quality, and an 80% team retention rate",
                "Provided each team and the board with comprehensive metrics through various static code analysis and performance test tools that allowed each team to create progressive milestones throughout the sprint, which increased product team ownership, a 25% improvement in code quality and a 20% increase in security compliance",
                "Cultivated an agile-driven culture across engineering teams using Azure DevOps by removing roadblocks and technical limitations, resulting in a 30% increase in speed in product delivery.",
                "Help foster test-driven development within each team's agile development practices, resulting in a 25% reduction in software bugs and increased software quality",
                "Hired and mentored five developers, guiding some to become influential team leaders, resulting in improved team culture, satisfaction and retention"
            ],
            "skills": ["Team Leadership", "People Management", "Project Management", "Angular", "Azure DevOps", "TDD", "Microservices", "Agile"]
        },
        {
            "companyName": "Pearson Australia",
            "companyUrl": "https://www.pearson.com/en-au/",
            "jobTitle": "Software Development Manager",
            "jobLength": "September 2015 - December 2017",
            "highlights": [
                "Managed a team of 4 developers (onshore & offshore) in agile-driven development, successfully delivering a critical number of projects using Angular 2+ and TypeScript within budget and time constraints.",
                "Worked with multiple teams to devise best practices and coding standards, resulting in a 20% increase in code quality and consistency across projects",
                "Collaborated with a team member who achieved a high sprint completion rate (90%) by setting clear goals, defining precise acceptance criteria, and implementing effective planning, which ensured timely and in-scope delivery."
            ],
            "skills": ["People Management", "Project Management", "Angular", "SQL", "C#", "Agile", "Azure DevOps", "CI/CD"]
        },
        {
            "companyName": "LMI Group",
            "companyUrl": "https://lmigroup.io/",
            "jobTitle": "Development Team Lead",
            "jobLength": "June 2014 - September 2015",
            "highlights": [
                "Collaborated with technical team and business experts to create and support optimal production and test environments, reducing testing time by 30%.",
                "Managed a team of 5, successfully delivering several significant projects, improving project delivery speed by 25%",
                "Ensured codebase quality through rigorous code reviews and testing, resulting in a 20% reduction in calculation errors.",
                "Streamlined development, deployment, and testing pipeline through implementing CI/CD, reducing deployment time by 50%."
            ],
            "skills": ["People Management", "Angular", "SQL", "C#", "Agile"]
        },
        {
            "companyName": "Pearson Australia",
            "companyUrl": "https://www.pearson.com/en-au/",
            "jobTitle": "Web Developer",
            "jobLength": "February 2013 - June 2014",
            "highlights": [
                "Designed, developed, and implemented an extensible online assessment for the Educational Department, improving assessment processing speed by 30%.",
                "Managed critical projects in an agile environment manner, achieving on-time project completion."
            ],
            "skills": ["SQL", "C#", "ASP.NET MVC", "Javascript"]
        },
        {
            "companyName": "Mentor Technology Group",
            "companyUrl": "",
            "jobTitle": "Analyst Programmer",
            "jobLength": "March 2010 - January 2013",
            "highlights": [
                "Assisted senior developer in designing and developing multi-tenant architecture, contributing to a 20% increase in system efficiency.",
                "Facilitated codebase migration from Java to .NET, reducing migration time by 25% and improving codebase maintainability.",
                "Developed extensions and upgrades to existing websites, enhancing performance by 30%.",
                "Refactored codebases, resulting in a 20% improvement in software performance and reliability.",
                "Created a CMS-integrated website with a payment gateway, increasing user engagement by 40%."
            ],
            "skills": ["SQL", "C#", "ASP.NET Webform", "Java", "Javascript"]
        }
    ],
    "projects": [
        {
            "title": "E-commerce Marketing Supply Chain Management",
            "link": "https://prominateshop.com/",
            "description": "Migrated existing large-scale e-commerce marketing supply chain from monolith ASP.NET MVC application to microservice in AWS public cloud with react front end.",
            "duration": "June 2022 - Present",
            "responsibilities": [
                "Planned decomposed monolith by business domain and through the implementation of strangler pattern for a seamless transition.",
                "Build API integration with multiple accounting systems (Business Central, Exonet) leveraging AWS SQS for fire-and-forget patterns.",
                "Migration resulted in increased performance, resilience, agility and reduced operation costs by 25%"
            ]
        },
        {
            "title": "Monopoly Shop Scan Win",
            "link": "https://www.monopolyshopscanwin.com.au/",
            "description": "Monopoly Shop Scan Win provides a fun, gamified shopping experience. It rewards customers for their in-centre visitation and spending and encourages them to explore new retailers and support local businesses.",
            "duration": "January 2023 - August 2023",
            "responsibilities": [
                "Successfully integrated Azure Form Recognizer for receipt scanner capability with tight deadline delivery."
            ]
        },
        {
            "title": "HR & Payroll Design System",
            "link": "https://au.frontiersoftware.com/module/ichris",
            "description": "Building a design system collection of reusable UI elements with the team as part of the UI refresh of all product suites. This will bring consistency and rapid development for the new team when building any new application/module.",
            "duration": "January 2020 - June 2022",
            "responsibilities": [
                "Break down the flagship payroll AngularJs application into reusable Angular components and a web components library, which later became the design system's building block."
            ]
        },
        {
            "title": "Pearson Lightbook",
            "link": "https://www.pearson.com/en-au/schools/secondary/digital/lightbook",
            "description": "Lightbook is a digital textbook platform for secondary school learners and educators in Australia. It offers interactive features such as videos, animations, quizzes, and personalized learning tracking.",
            "duration": "December 2016 - December 2017",
            "responsibilities": [
                "Led the team of 4 developers to rebuild the application from Ember to Angular with a .NET API backend in an agile development environment."
            ]
        }
    ]
}